src/Catalogs/КассыККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>КассыККМ</Name>
			<Comment>Кассы контрольно-кассовых машин</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДенежныхСредств</Name>
					<Comment>Валюта, в которой работает ККМ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Comment>Оборудование</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерPOS</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыПодключаемогоОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыПодключаемогоОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СканерШтрихкода</Name>
					<Comment>Scanner</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательМагнитныхКарт</Name>
					<Comment>MSR</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККТ</Name>
					<Comment>KKT</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФискальныйРегистратор</Name>
					<Comment>FiscalPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЧеков</Name>
					<Comment>ReceiptPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДисплейПокупателя</Name>
					<Comment>LineDisplay</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалСбораДанных</Name>
					<Comment>DataCollectionTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Comment>AcquiringTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныеВесы</Name>
					<Comment>Scale</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесыСПечатьюЭтикеток</Name>
					<Comment>ScaleOffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККМОфлайн</Name>
					<Comment>ECROffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЭтикеток</Name>
					<Comment>LabelPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательRFID</Name>
					<Comment>RFID</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьWebСервисОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рарус</Name>
					<Comment>Rarus</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УКМ5</Name>
					<Comment>Сарабеев</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/НастройкиРМК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>НастройкиРМК</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонРаботыДисплеяПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныРаботыДисплеяПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговыйОтдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КассыККМ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КассаККМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодключаемоеОборудование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/КассыККМ/Ext/ManagerModule.bsl
// Модуль менеджера справочника "Кассы ККМ"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Возвращает основную кассу ККМ рабочего места пользователя по данным настроек РМК
//
// Параметры:
//  РабочееМесто - СправочникСсылка.РабочиеМеста - Касса будет определена для указанного либо текущего рабочего места.
//
// Возвращаемое значение:
//  СправочникСсылка.КассыККМ - если не заданы настройки РМК или не получилось определить текущее рабочее место.
//
Функция ПолучитьОсновнуюКассуККМ(РабочееМесто=Неопределено) Экспорт
	
	// Произведем уточнение текущего рабочего места
	Если НЕ ЗначениеЗаполнено(РабочееМесто) Тогда
		РабочееМесто = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();
	КонецЕсли;
	
	// Прекращаем обработку, если рабочее место идентифицировать не удалось
	Если НЕ ЗначениеЗаполнено(РабочееМесто) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Формируем запрос к настройкам рабочего места
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	НастройкиРМККассыККМ.КассаККМ КАК КассаККМ,
	|	ВЫБОР
	|		КОГДА НастройкиРМККассыККМ.ПодключаемоеОборудование.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.ФискальныйРегистратор)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПодключенФР,
	|	НастройкиРМККассыККМ.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Справочник.НастройкиРМК.КассыККМ КАК НастройкиРМККассыККМ
	|ГДЕ
	|	НастройкиРМККассыККМ.Ссылка.РабочееМесто = &РабочееМесто
	|	И НЕ НастройкиРМККассыККМ.ПодключаемоеОборудование.ПометкаУдаления
	|	И НастройкиРМККассыККМ.ПодключаемоеОборудование.УстройствоИспользуется
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПодключенФР УБЫВ,
	|	НомерСтроки";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
	
	// Выполняем запрос и получаем ККМ
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.КассаККМ, Неопределено);
	
КонецФункции // ПолучитьОсновнуюКассуККМ()

// Возвращает кассу ККМ для указанного подключаемого оборудования и номеру кассы
//
// Параметры:
//  Оборудование - СправочникСсылка.ПодключаемоеОборудование - Касса будет определена для указанного подключаемого оборудования.
//  НомерКассы - число - номер кассы магазина.
//
// Возвращаемое значение:
//  СправочникСсылка.КассыККМ - если не заданы настройки РМК или не получилось определить текущее рабочее место.
//
Функция ПолучитьКассуККМОборудования(Оборудование, НомерКассы, НаименованиеКассы = Неопределено) Экспорт
	
	Результат = Справочники.КассыККМ.ПустаяСсылка();
	
	// Произведем уточнение текущего рабочего места
	Если НЕ ЗначениеЗаполнено(Оборудование) Тогда
		Возврат Результат;
	КонецЕсли;
	
	// Прекращаем обработку, если рабочее место идентифицировать не удалось
	Если НЕ ЗначениеЗаполнено(НомерКассы) Тогда
		Возврат Результат;
	КонецЕсли;
	
	// Формируем запрос к настройкам рабочего места
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	КассыККМ.Ссылка КАК КассаККМ
	|ИЗ
	|	Справочник.КассыККМ КАК КассыККМ
	|ГДЕ
	|	КассыККМ.Оборудование    = &Оборудование И 
	|	КассыККМ.НомерPOS        = &НомерКассы И 
	|	КассыККМ.ПометкаУдаления = ЛОЖЬ
	|";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Оборудование", Оборудование);
	Запрос.УстановитьПараметр("НомерКассы",   НомерКассы);
	
	// Выполняем запрос и получаем ККМ
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.КассаККМ;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		КассаККМ = Справочники.КассыККМ.СоздатьЭлемент();
		КассаККМ.ВалютаДенежныхСредств = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		КассаККМ.Оборудование          = Оборудование;
		Если ЗначениеЗаполнено(Оборудование.Организация) Тогда
			КассаККМ.Организация = Оборудование.Организация;
		Иначе
			КассаККМ.Организация = Оборудование.ОсновнойОтдел.Организация;
		КонецЕсли;
		КассаККМ.ПодразделениеКомпании = Оборудование.ОсновнойОтдел.ПодразделениеКомпании;
		КассаККМ.НомерPOS              = НомерКассы;
		Если НаименованиеКассы = "" Тогда
			КассаККМ.Наименование = "Касса № " + Формат(НомерКассы, "ЧГ=");
		Иначе
			КассаККМ.Наименование = НаименованиеКассы;
		КонецЕсли;
		КассаККМ.УстановитьНовыйКод();
		КассаККМ.Записать();
		
		Результат = КассаККМ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ПолучитьКассуККМОборудования()

////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	ОбязательныеРеквизиты.Добавить("ПодразделениеКомпании");
	ОбязательныеРеквизиты.Добавить("Организация");
	ОбязательныеРеквизиты.Добавить("ВалютаДенежныхСредств");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Код");
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьУникальныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события возникающего при изменении данных реквизита "Подразделение компании".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Вызываем общий обработчик события
	ОбработкаСобытийСправочникаСервер.ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ПодразделениеПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Организация".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОрганизацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Вызываем общий обработчик события
	ОбработкаСобытийСправочникаСервер.ОрганизацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОрганизацияПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

#КонецЕсли
